var text1 = document.getElementById("text1");
var text2 = document.getElementById("text2");
var text3 = document.getElementById("text3");
var text4 = document.getElementById("text4");
var text5 = document.getElementById("text5");
var text6 = document.getElementById("text6");
var text7 = document.getElementById("text7");
var text8 = document.getElementById("text8");
var text9 = document.getElementById("text9");
var text10 = document.getElementById("text10");
text1.addEventListener("click", () => {
	document.getElementById("inputText").value = "Η Σειρά Ταινιών Άρχοντας των Δαχτυλιδιών  είναι μία περιπετειώδης τριλογία, σκηνοθετημένη από τον Πίτερ Τζάκσον. " +
		"Το σενάριο βασίστηκε στα τρία μυθιστορήματα του Τζ. Ρ. Ρ. Τόλκιν. " +
		"Οι τρεις ταινίες που περιλαμβάνονται στην τριλογία είναι Η Συντροφιά του Δαχτυλιδιού (2001), Οι Δυο Πύργοι (2002) και Η Επιστροφή του Βασιλιά (2003). " +
		"Η διανομή έγινε από τη New Line Cinema μαζί με την WingNut Films. " +
		"Οι ταινίες είχαν τους εξής ηθοποιούς: Ελάιτζα Γουντ, Ίαν ΜακΚέλεν, Λιβ Τάιλερ, Βίγκο Μόρτενσεν, Σον Άστιν, Κέιτ Μπλάνσετ, Τζον Ρις-Ντέιβις, " +
		"Μπίλι Μπόιντ, Ορλάντο Μπλουμ, Κρίστοφερ Λι, Άντι Σέρκις, Σον Μπιν και Χιούγκο Γουίβινγκ.";
});
text2.addEventListener("click", () => {
	document.getElementById("inputText").value = "Ο Νίκος Καζαντζάκης γεννήθηκε στο Ηράκλειο στην Κρήτη. Θεωρήθηκε  γίγαντας της Νεοελληνικής Λογοτεχνίας και ήταν υποψήφιος για το βραβείο Νόμπελ. " +
		"Έγινε ακόμη γνωστότερος μέσω της κινηματογραφικής απόδοσης των έργων του Ο Χριστός Ξανασταυρώνεται, " +
		"ο Καπετάν Μιχάλης, Βίος και Πολιτεία του Αλέξη Ζορμπά και Ο Τελευταίος Πειρασμός του Χριστού. " +
		"Μετέφρασε επίσης μια σειρά από αξιόλογα έργα στα Νέα Ελληνικά, όπως η Θεία Κωμωδία και η Ιλιάδα.";
});
text3.addEventListener("click", () => {
	document.getElementById("inputText").value = "Οι Scorpions είναι ένα Hard Rock συγκρότημα από το Αννόβερο της Γερμανίας. Σχηματίστηκε το 1965 από τον κιθαρίστα Ρούντολφ Σένκερ, " +
		"ο οποίος είναι το μόνο σταθερό μέλος της μπάντας. " +
		"Το συγκρότημα έγινε γνωστό κατά τη Δεκαετία του 1980. " +
		"Το συγκρότημα αποτελούσαν οι " +
		"Ρούντολφ Σένκερ (Kιθάρα), Κλάους Μάινε (Φωνή), Ματίας Γιαμπς (Kιθάρα), Φράνσις Μπούχολτς (Μπάσο) και Χέρμαν Ράρεμπελ (Ντραμς).";
});
text4.addEventListener("click", () => {
	document.getElementById("inputText").value = "Οι Τελικοί ΝΒΑ του 2011 ήταν η σειρά τελικών της Εθνικής Ομοσπονδίας Καλαθοσφαίρισης (NBA) μεταξύ του πρωταθλητή της Δυτικής Περιφέρειας Ντάλας Μάβερικς, " +
		"που νίκησε τον πρωταθλητή της Ανατολικής Περιφέρειας Μαϊάμι Χιτ για να κερδίσουν το πρώτο τους πρωτάθλημα ΝΒΑ. " +
		"Ο παίκτης των Mavericks, Ντιρκ Νοβίτσκι, αναδείχθηκε MVP των τελικών. " +
		"Πηγαίνοντας στη σειρά, οι Heat ήταν το φαβορί με τους νεοαποκτηθέντες σούπερ σταρ τους ΛεΜπρόν Τζέιμς και Κρις Μπος μαζί με τον επανερχόμενο σούπερ σταρ " +
		"Ντουέιν Γουέιντ.";
});
text5.addEventListener("click", () => {
	document.getElementById("inputText").value = "Ο Ιάσονας είχε κερδίσει την εύνοια από τις θεές Ήρα και Αθηνά. Με τη βοήθειά τους ο Ιάσονας κατασκεύασε το θρυλικό πλοίο Αργώ, που είχε 50 κουπιά. " +
		"Επιστράτευσε 50 αξιόλογους ανθρώπους που ονομάζονταν Αργοναύτες. Περιλάμβαναν μια γυναίκα, την Αταλάντη, και τον Ηρακλή, τον ισχυρότερο άντρα που έζησε ποτέ. " +
		"Ο Ορφέας, ο ποιητής από τη Θράκη, που μπορούσε να τραγουδήσει πιο γλυκά από τις Σειρήνες, καθώς και ο Κάστορας και ο Πολυδεύκης, τα αδέρφια της Ελένης της Τροίας, " +
		"που ήταν και στην ομάδα των Αργοναυτών.";
});
text6.addEventListener("click", () => {
	document.getElementById("inputText").value = "Ο Αριστοτέλης  ήταν αρχαίος Έλληνας φιλόσοφος και επιστήμονας που γεννήθηκε στα Στάγειρα  στην Μακεδονία στην Βόρεια Ελλάδα, ενώ ο πατέρας του ήταν ο Νικόμαχος. " +
		"Σε ηλικία 17 ετών εισέρχεται στην Ακαδημία του Πλάτωνα, στην Αθήνα, όπου παραμένει έως τα 37 του έτη (347 π.Χ.). " +
		"Εκεί συνδέεται τόσο με τον ίδιο τον Πλάτωνα όσο και με τον Εύδοξο, τον Ξενοκράτη και άλλους στοχαστές. " +
		"Ιδρυσε μια βιβλιοθήκη στο Λύκειο, η οποία έγινε αρωγός στην παραγωγή εκατοντάδων έργων του " +
		"Μετά τον θάνατο του Πλάτωνα, φεύγει από την Αθήνα και κατόπιν εντολής του Φιλίππου Β, αναλαμβάνει το 343 π.Χ. τη διδασκαλία του Μεγάλου Αλεξάνδρου.";
});
text7.addEventListener("click", () => {
	document.getElementById("inputText").value = "Ο Νονός είναι μία δραματική γκανγκστερική κινηματογραφική ταινία του 1972 βασισμένη στο ομώνυμο μυθιστόρημα του Μάριο Πούζο. Σκηνοθέτης " +
		"ήταν ο Φράνσις Φορντ Κόπολα και πρωταγωνιστές τον Μάρλον Μπράντο και τον Αλ Πατσίνο και τους " +
		"Τζέιμς Κάαν, Ρίτσαρντ Καστελάνο, Ρόμπερτ Ντυβάλ, Στέρλινγκ Χέιντεν, Τζον Καζάλ, Ντάιαν Κίτον, Ρίτσαρντ Καστελάνο και Τζον Μάρλευ. " +
		"Η ιστορία έλαβε χώρα από το 1945 μέχρι το 1955 και σχετίζεται με την  Οικογένεια Κορλεόνε.";
});
text8.addEventListener("click", () => {
	document.getElementById("inputText").value = "Το Τατζ Μαχάλ (Taj Mahal) είναι κτιριακό συγκρότημα που βρίσκεται στην Ινδία, " +
		"κτισμένο στη νότια όχθη του ποταμού Γιαμούνα κοντά στη πόλη Άγκρα. " +
		"Το συγκρότημα αναπτύσσεται γύρω από το Μαυσωλείο που ανήγειρε ο Σαχ Τζαχάν Μογγόλος αυτοκράτορας (Σάχης) " +
		"προκειμένου να τιμήσει τη πολυαγαπημένη του σύζυγο Μουμτάζ Μαχάλ που πέθανε το 1631 κατά τη διάρκεια τοκετού. " +
		"Για την ανέγερσή του, που έγινε σε σχέδια ομάδας αρχιτεκτόνων από την Ινδία και το σημερινό Πακιστάν.";
});
text9.addEventListener("click", () => {
	document.getElementById("inputText").value = "Ο Δίσκος της Φαιστού είναι δίσκος ψημένου πηλού, που αποτελεί αρχαιολογικό εύρημα από τη Μινωική πόλη της Φαιστού " +
		"στη νότια Κρήτη στον ίδιο νομό που βρίσκεται το Ηράκλειο, και χρονολογείται πιθανώς στην μέση ή ύστερη Μινωική Εποχή του Χαλκού (Δεύτερη π.Χ. χιλιετία). " +
		"Αποτελεί ένα από τα γνωστότερα μυστήρια της αρχαιολογίας, αφού ο σκοπός της κατασκευής του παραμένει άγνωστος. " +
		"Άγνωστο είναι μέχρι σήμερα και το νόημα των αναγραφόμενων σε αυτόν. " +
		"Ο δίσκος ανακαλύφθηκε το 1908 από τον Ιταλό αρχαιολόγο Λουίτζι Περνιέ  και φυλάσσεται σήμερα στο Αρχαιολογικό Μουσείο Ηρακλείου.";
});
text10.addEventListener("click", () => {
	document.getElementById("inputText").value = "Ο Λεονάρντο ντα Βίντσι γεννήθηκε  στην περιοχή της Φλωρεντίας στην Ιταλία. " +
		"Μαθήτευσε στο εργαστήριο του φημισμένου Ιταλού ζωγράφου Αντρέα ντελ Βερρόκκιο. " +
		"Μεγάλο μέρος της πρώιμης εργασιακής ζωής του το πέρασε στην υπηρεσία του Λουδοβίκου Σφόρτσα στο Μιλάνο, " +
		"αργότερα εργάστηκε στη Ρώμη, την Μπολόνια και τη Βενετία. Πέρασε τα τρία τελευταία χρόνια της ζωής του στη Γαλλία όπου και πέθανε το 1519. " +
		"Η Μόνα Λίζα είναι το διασημότερο ζωγραφικό έργο του και το πιο διάσημο πορτραίτο στην ιστορία, " +
		"ενώ ο Μυστικός Δείπνος του είναι ο πλέον ανατυπωμένος θρησκευτικός πίνακας.";
});